In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [10]:
dates = pd.date_range('20180111', periods = 6)
df = pd.DataFrame(np.random.rand(6, 4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2018-01-11  0.730832  0.059712  0.018821  0.936189
2018-01-12  0.031500  0.026363  0.831795  0.039262
2018-01-13  0.492948  0.017319  0.687009  0.868612
2018-01-14  0.275111  0.866226  0.628340  0.221842
2018-01-15  0.480357  0.448712  0.849338  0.623080
2018-01-16  0.579997  0.898396  0.462811  0.249872

In [38]:
df2 = df.copy()

In [39]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2018-01-11  0.730832  0.059712  0.018821  0.936189    one
2018-01-12  0.031500  0.026363  0.831795  0.039262    one
2018-01-13  0.492948  0.017319  0.687009  0.868612    two
2018-01-14  0.275111  0.866226  0.628340  0.221842  three
2018-01-15  0.480357  0.448712  0.849338  0.623080   four
2018-01-16  0.579997  0.898396  0.462811  0.249872  three

In [40]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2018-01-13  0.492948  0.017319  0.687009  0.868612   two
2018-01-15  0.480357  0.448712  0.849338  0.623080  four

In [52]:
df2 = df.copy()
df2[df2 > .6] = -df2

In [53]:
df2

                   A         B         C         D
2018-01-11 -0.730832  0.059712  0.018821 -0.936189
2018-01-12  0.031500  0.026363 -0.831795  0.039262
2018-01-13  0.492948  0.017319 -0.687009 -0.868612
2018-01-14  0.275111 -0.866226 -0.628340  0.221842
2018-01-15  0.480357  0.448712 -0.849338 -0.623080
2018-01-16  0.579997 -0.898396  0.462811  0.249872

In [56]:
 df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [57]:
df1

                   A         B         C         D   E
2018-01-11  0.730832  0.059712  0.018821  0.936189 NaN
2018-01-12  0.031500  0.026363  0.831795  0.039262 NaN
2018-01-13  0.492948  0.017319  0.687009  0.868612 NaN
2018-01-14  0.275111  0.866226  0.628340  0.221842 NaN

In [58]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [59]:
df1

                   A         B         C         D    E
2018-01-11  0.730832  0.059712  0.018821  0.936189  1.0
2018-01-12  0.031500  0.026363  0.831795  0.039262  1.0
2018-01-13  0.492948  0.017319  0.687009  0.868612  NaN
2018-01-14  0.275111  0.866226  0.628340  0.221842  NaN

In [61]:
df1.dropna(how = 'any')

                   A         B         C         D    E
2018-01-11  0.730832  0.059712  0.018821  0.936189  1.0
2018-01-12  0.031500  0.026363  0.831795  0.039262  1.0

In [62]:
df1.fillna(value = 5)

                   A         B         C         D    E
2018-01-11  0.730832  0.059712  0.018821  0.936189  1.0
2018-01-12  0.031500  0.026363  0.831795  0.039262  1.0
2018-01-13  0.492948  0.017319  0.687009  0.868612  5.0
2018-01-14  0.275111  0.866226  0.628340  0.221842  5.0

In [63]:
df1.fillna(value=5)

                   A         B         C         D    E
2018-01-11  0.730832  0.059712  0.018821  0.936189  1.0
2018-01-12  0.031500  0.026363  0.831795  0.039262  1.0
2018-01-13  0.492948  0.017319  0.687009  0.868612  5.0
2018-01-14  0.275111  0.866226  0.628340  0.221842  5.0

In [66]:
pd.isnull(df1)

                A      B      C      D      E
2018-01-11  False  False  False  False  False
2018-01-12  False  False  False  False  False
2018-01-13  False  False  False  False   True
2018-01-14  False  False  False  False   True

In [67]:
df1.mean()

A    0.382598
B    0.242405
C    0.541491
D    0.516476
E    1.000000
dtype: float64

In [68]:
df

                   A         B         C         D
2018-01-11  0.730832  0.059712  0.018821  0.936189
2018-01-12  0.031500  0.026363  0.831795  0.039262
2018-01-13  0.492948  0.017319  0.687009  0.868612
2018-01-14  0.275111  0.866226  0.628340  0.221842
2018-01-15  0.480357  0.448712  0.849338  0.623080
2018-01-16  0.579997  0.898396  0.462811  0.249872

In [69]:
df.apply(np.cumsum)

                   A         B         C         D
2018-01-11  0.730832  0.059712  0.018821  0.936189
2018-01-12  0.762333  0.086075  0.850615  0.975450
2018-01-13  1.255281  0.103395  1.537624  1.844062
2018-01-14  1.530392  0.969621  2.165964  2.065905
2018-01-15  2.010749  1.418333  3.015303  2.688985
2018-01-16  2.590746  2.316728  3.478113  2.938857

In [77]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [78]:
s

0    4
1    3
2    0
3    4
4    3
5    5
6    4
7    4
8    2
9    4
dtype: int64

In [79]:
s.value_counts()

4    5
3    2
5    1
2    1
0    1
dtype: int64

In [80]:
s = pd.Series(['a', 'hell', 'dsfHe'])

In [84]:

s.value_counts()

dsfHe    1
hell     1
a        1
dtype: int64

In [85]:
np.random.randn(10, 4)

array([[ 0.71932276, -0.13697935,  0.58913513,  1.46766073],
       [ 0.86544642,  2.28074301, -0.68750936,  0.0332449 ],
       [ 0.27661936,  0.74395181,  0.35813979,  0.87204475],
       [-0.32110246, -0.73774077,  0.06294365, -0.42106661],
       [ 0.20389672,  1.04520093,  0.54614435, -0.15455561],
       [ 1.11668756, -0.08946868,  0.12650229, -0.29489048],
       [-0.48741198,  1.13535904, -1.04216744,  1.17214057],
       [ 0.9435988 , -0.3343785 ,  0.43723167,  0.07759412],
       [ 0.53539683,  0.71457065,  0.30257718, -1.02382439],
       [ 0.84533089, -0.23459212,  1.85156438, -1.01294617]])

In [92]:
df = pd.DataFrame(np.random.randint(0, 10, size=(5, 4)))

In [93]:
df

   0  1  2  3
0  0  8  9  3
1  1  9  7  4
2  5  2  4  3
3  2  4  6  7
4  5  3  6  0

In [95]:
pieces = [df[:3], df[3:5]]

In [96]:
pieces

[   0  1  2  3
 0  0  8  9  3
 1  1  9  7  4
 2  5  2  4  3,    0  1  2  3
 3  2  4  6  7
 4  5  3  6  0]

In [97]:
pd.concat(pieces)

   0  1  2  3
0  0  8  9  3
1  1  9  7  4
2  5  2  4  3
3  2  4  6  7
4  5  3  6  0

In [98]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [99]:
df

          A         B         C         D
0 -1.897650 -0.314522  1.385186 -0.984884
1  0.753610 -0.448092  0.403438  1.344245
2  0.145959 -0.136249  0.988288 -0.786067
3 -0.054426  0.862000 -0.669201 -0.386379
4 -0.482309 -0.270705 -0.442049  1.637162
5 -1.441409 -0.042228 -0.341817  0.246169
6 -0.610923  1.113478 -0.287368  1.417596
7 -1.172188 -0.730729  1.092179  0.241100

In [100]:
s = df.iloc[3]

In [103]:
df[:3]

          A         B         C         D
0 -1.897650 -0.314522  1.385186 -0.984884
1  0.753610 -0.448092  0.403438  1.344245
2  0.145959 -0.136249  0.988288 -0.786067

In [109]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -1.897650 -0.314522  1.385186 -0.984884
1  0.753610 -0.448092  0.403438  1.344245
2  0.145959 -0.136249  0.988288 -0.786067
3 -0.054426  0.862000 -0.669201 -0.386379
4 -0.482309 -0.270705 -0.442049  1.637162
5 -1.441409 -0.042228 -0.341817  0.246169
6 -0.610923  1.113478 -0.287368  1.417596
7 -1.172188 -0.730729  1.092179  0.241100
8 -0.054426  0.862000 -0.669201 -0.386379

In [110]:
df

          A         B         C         D
0 -1.897650 -0.314522  1.385186 -0.984884
1  0.753610 -0.448092  0.403438  1.344245
2  0.145959 -0.136249  0.988288 -0.786067
3 -0.054426  0.862000 -0.669201 -0.386379
4 -0.482309 -0.270705 -0.442049  1.637162
5 -1.441409 -0.042228 -0.341817  0.246169
6 -0.610923  1.113478 -0.287368  1.417596
7 -1.172188 -0.730729  1.092179  0.241100

In [111]:
 df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})

In [112]:
df

     A      B         C         D
0  foo    one  0.095730 -1.120135
1  bar    one  1.453424  1.118153
2  foo    two -0.996742  0.116946
3  bar  three  0.615398 -1.641522
4  foo    two -0.982149 -0.340838
5  bar    two -0.577518 -0.745660
6  foo    one -0.158437 -2.115929
7  foo  three -0.214721  0.304302

In [118]:
df.groupby('A')

In [119]:
df.groupby('A').sum()

            C         D
A
bar  1.491304 -1.269029
foo -2.256318 -3.155654

In [120]:
 tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                         'one', 'two', 'one', 'two']]))

In [125]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [129]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [130]:
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [131]:
df

     A      B         C         D
0  foo    one  0.095730 -1.120135
1  bar    one  1.453424  1.118153
2  foo    two -0.996742  0.116946
3  bar  three  0.615398 -1.641522
4  foo    two -0.982149 -0.340838
5  bar    two -0.577518 -0.745660
6  foo    one -0.158437 -2.115929
7  foo  three -0.214721  0.304302

In [132]:
stacked = df.stack()

In [133]:
stacked

0  A          foo
   B          one
   C    0.0957305
   D     -1.12013
1  A          bar
   B          one
   C      1.45342
   D      1.11815
2  A          foo
   B          two
   C    -0.996742
   D     0.116946
3  A          bar
   B        three
   C     0.615398
   D     -1.64152
4  A          foo
   B          two
   C    -0.982149
   D    -0.340838
5  A          bar
   B          two
   C    -0.577518
   D     -0.74566
6  A          foo
   B          one
   C    -0.158437
   D     -2.11593
7  A          foo
   B        three
   C    -0.214721
   D     0.304302
dtype: object

In [134]:
df2

                   A         B         C         D
2018-01-11 -0.730832  0.059712  0.018821 -0.936189
2018-01-12  0.031500  0.026363 -0.831795  0.039262
2018-01-13  0.492948  0.017319 -0.687009 -0.868612
2018-01-14  0.275111 -0.866226 -0.628340  0.221842
2018-01-15  0.480357  0.448712 -0.849338 -0.623080
2018-01-16  0.579997 -0.898396  0.462811  0.249872

In [135]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [136]:
df2 = df[:4]

In [137]:
df2

                     A         B
first second
bar   one     2.201232 -0.342680
      two    -0.491592 -0.174032
baz   one     1.066050 -1.630106
      two    -1.824522 -0.143726

In [138]:
stacked = df2.stack()

In [139]:
stacked

first  second
bar    one     A    2.201232
               B   -0.342680
       two     A   -0.491592
               B   -0.174032
baz    one     A    1.066050
               B   -1.630106
       two     A   -1.824522
               B   -0.143726
dtype: float64

In [146]:
stacked.unstack()

                     A         B
first second
bar   one     2.201232 -0.342680
      two    -0.491592 -0.174032
baz   one     1.066050 -1.630106
      two    -1.824522 -0.143726

In [143]:
stacked.unstack(1)

second        one       two
first
bar   A  2.201232 -0.491592
      B -0.342680 -0.174032
baz   A  1.066050 -1.824522
      B -1.630106 -0.143726

In [147]:
rng = pd.date_range('1/1/2018', periods=100, freq='S')

In [148]:
rng

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 00:00:01',
               '2018-01-01 00:00:02', '2018-01-01 00:00:03',
               '2018-01-01 00:00:04', '2018-01-01 00:00:05',
               '2018-01-01 00:00:06', '2018-01-01 00:00:07',
               '2018-01-01 00:00:08', '2018-01-01 00:00:09',
               '2018-01-01 00:00:10', '2018-01-01 00:00:11',
               '2018-01-01 00:00:12', '2018-01-01 00:00:13',
               '2018-01-01 00:00:14', '2018-01-01 00:00:15',
               '2018-01-01 00:00:16', '2018-01-01 00:00:17',
               '2018-01-01 00:00:18', '2018-01-01 00:00:19',
               '2018-01-01 00:00:20', '2018-01-01 00:00:21',
               '2018-01-01 00:00:22', '2018-01-01 00:00:23',
               '2018-01-01 00:00:24', '2018-01-01 00:00:25',
               '2018-01-01 00:00:26', '2018-01-01 00:00:27',
               '2018-01-01 00:00:28', '2018-01-01 00:00:29',
               '2018-01-01 00:00:30', '2018-01-01 00:00:31',
               '2018-01-01 00:00:32', '2018-01-01 00:00:33',
               '2018-01-01 00:00:34', '2018-01-01 00:00:35',
               '2018-01-01 00:00:36', '2018-01-01 00:00:37',
               '2018-01-01 00:00:38', '2018-01-01 00:00:39',
               '2018-01-01 00:00:40', '2018-01-01 00:00:41',
               '2018-01-01 00:00:42', '2018-01-01 00:00:43',
               '2018-01-01 00:00:44', '2018-01-01 00:00:45',
               '2018-01-01 00:00:46', '2018-01-01 00:00:47',
               '2018-01-01 00:00:48', '2018-01-01 00:00:49',
               '2018-01-01 00:00:50', '2018-01-01 00:00:51',
               '2018-01-01 00:00:52', '2018-01-01 00:00:53',
               '2018-01-01 00:00:54', '2018-01-01 00:00:55',
               '2018-01-01 00:00:56', '2018-01-01 00:00:57',
               '2018-01-01 00:00:58', '2018-01-01 00:00:59',
               '2018-01-01 00:01:00', '2018-01-01 00:01:01',
               '2018-01-01 00:01:02', '2018-01-01 00:01:03',
               '2018-01-01 00:01:04', '2018-01-01 00:01:05',
               '2018-01-01 00:01:06', '2018-01-01 00:01:07',
               '2018-01-01 00:01:08', '2018-01-01 00:01:09',
               '2018-01-01 00:01:10', '2018-01-01 00:01:11',
               '2018-01-01 00:01:12', '2018-01-01 00:01:13',
               '2018-01-01 00:01:14', '2018-01-01 00:01:15',
               '2018-01-01 00:01:16', '2018-01-01 00:01:17',
               '2018-01-01 00:01:18', '2018-01-01 00:01:19',
               '2018-01-01 00:01:20', '2018-01-01 00:01:21',
               '2018-01-01 00:01:22', '2018-01-01 00:01:23',
               '2018-01-01 00:01:24', '2018-01-01 00:01:25',
               '2018-01-01 00:01:26', '2018-01-01 00:01:27',
               '2018-01-01 00:01:28', '2018-01-01 00:01:29',
               '2018-01-01 00:01:30', '2018-01-01 00:01:31',
               '2018-01-01 00:01:32', '2018-01-01 00:01:33',
               '2018-01-01 00:01:34', '2018-01-01 00:01:35',
               '2018-01-01 00:01:36', '2018-01-01 00:01:37',
               '2018-01-01 00:01:38', '2018-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [149]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [153]:
ts.resample('10Min').sum()

2018-01-01    24852
Freq: 10T, dtype: int64

In [15]:
a = np.random.randint(0, 15, size = [400, 400])

In [16]:
print (a)
a += a.T
print (a)

[[ 5  3  6 ..., 11  8  9]
 [ 8 13  5 ...,  7  1 10]
 [ 6  7 13 ..., 12  8  6]
 ...,
 [13 10  0 ...,  4  3  6]
 [11  2 12 ..., 13 11  9]
 [ 5 11  7 ...,  6 13  0]]
[[10 11 12 ..., 24 19 14]
 [11 26 12 ..., 17  3 21]
 [12 12 26 ..., 12 20 13]
 ...,
 [24 17 12 ...,  8 16 12]
 [19  3 20 ..., 16 22 22]
 [14 21 13 ..., 12 22  0]]

In [31]:
np.triu([[1,2,3],[1,2,3],[1,2,3],[1,2,3],[4,5,6],[7,8,9],[10,11,12]], 1)

array([[0, 2, 3],
       [0, 0, 3],
       [0, 0, 0],
       [0, 0, 0],
       [0, 0, 0],
       [0, 0, 0],
       [0, 0, 0]])

In [ ]:
import